1. ^ - начало строки
2. $ - конец строки
3. . - любой символ
4. * - ноль или более повторений предыдущего символа
5. + - одно или более повторений предыдущего символа
6. ? - ноль или одно повторение предыдущего символа
7. [] - набор символов, например [abc] соответствует любому из символов a, b или c
8. [^] - набор символов, которые не должны встречаться, например [^abc] соответствует любому символу, кроме a, b или c
9. () - группировка выражений
10. | - оператор "или"
11. \d - любая цифра
12. \D - любой символ, кроме цифры
13. \s - любой пробельный символ (пробел, табуляция и тд)
14. \S - любой символ, кроме пробельного
15. \w - любой алфавитно-цифровой символ (буква или цифра)
16. \W - любой символ, кроме алфавитно-цифрового
17. {n} - ровно n повторений предыдущего символа
18. {n,} - n или более повторений предыдущего символа
19. {n,m} - от n до m повторений предыдущего символа
20. \b - граница слова
21. \B - не граница слова
22. (?=...) - положительная опережающая проверка
23. (?!...) - отрицательная опережающая проверка
24. \1, \2, ... - обратные ссылки на группы
25. (?i) - включение режима игнорирования регистра символов
26. (?s) - включение режима однострочного поиска
